In [1]:
import pandas as pd

In [2]:
dataframe=pd.read_csv("dataset_review.csv")

In [3]:
print(dataframe.head(2))

    Book   p1   p2 p3 p4 p5   p6 p7 p8
0  book1  3.5    2  5  3  -    -  5  3
1  book2    2  3.5  1  4  4  4.5  2  -

In [4]:
print(dataframe.tail(3))

    Book   p1   p2 p3   p4 p5   p6 p7   p8
5  book6  1.5  3.5  1  4.5  -  4.5  4  2.5
6  book7  2.5    -  -    4  4    4  5    3
7  book8    2    3  -    2  1    4  -    -

In [5]:
df=dataframe.replace("-",float("Nan"))

In [6]:
df

    Book   p1   p2   p3   p4   p5   p6   p7   p8
0  book1  3.5    2    5    3  NaN  NaN    5    3
1  book2    2  3.5    1    4    4  4.5    2  NaN
2  book3  NaN    4    1  4.5    1    4  NaN  NaN
3  book4  4.5  NaN    3  NaN    4    5    3    5
4  book5    5    2    5    3  NaN    5    5    4
5  book6  1.5  3.5    1  4.5  NaN  4.5    4  2.5
6  book7  2.5  NaN  NaN    4    4    4    5    3
7  book8    2    3  NaN    2    1    4  NaN  NaN

In [7]:
df1=df.drop(['p3','p4','p5','p6','p7','p8'],axis=1)

In [8]:
df2=df1[df1['p1'].notnull()]

In [9]:
df2=df1[df1['p2'].notnull()]

In [10]:
df2=df2[df2['p1'].notnull()]

In [11]:
df2

    Book   p1   p2
0  book1  3.5    2
1  book2    2  3.5
4  book5    5    2
5  book6  1.5  3.5
7  book8    2    3

In [12]:
import array as ar

In [13]:
p=ar.array('d',[])

In [14]:
from scipy.spatial import distance

In [15]:
from scipy.spatial.distance import cityblock

In [16]:
manhattandistance=distance.cityblock(df2['p1'].astype(float),df2['p2'].astype(float))

In [17]:
p1_p2=manhattandistance

In [18]:
p.append(p1_p2)

In [19]:
df1=df.drop(['p2','p4','p5','p6','p7','p8'],axis=1)

In [20]:
df3=df1[df1['p1'].notnull()]

In [21]:
df3=df1[df1['p3'].notnull()]

In [22]:
df3=df3[df3['p1'].notnull()]

In [23]:
df3

    Book   p1 p3
0  book1  3.5  5
1  book2    2  1
3  book4  4.5  3
4  book5    5  5
5  book6  1.5  1

In [24]:
manhattandistance=distance.cityblock(df3['p1'].astype(float),df3['p3'].astype(float))

In [25]:
p1_p3=manhattandistance

In [26]:
p.append(p1_p3)

In [27]:
df1=df.drop(['p2','p3','p5','p6','p7','p8'],axis=1)

In [28]:
df4=df1[df1['p1'].notnull()]

In [29]:
df4=df1[df1['p4'].notnull()]

In [30]:
df4=df4[df4['p1'].notnull()]

In [31]:
df4

    Book   p1   p4
0  book1  3.5    3
1  book2    2    4
4  book5    5    3
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    2

In [32]:
manhattandistance=distance.cityblock(df4['p1'].astype(float),df4['p4'].astype(float))

In [33]:
p1_p4=manhattandistance

In [34]:
p.append(p1_p4)

In [35]:
df1=df.drop(['p2','p3','p4','p6','p7','p8'],axis=1)

In [36]:
df5=df1[df1['p1'].notnull()]

In [37]:
df5=df1[df1['p5'].notnull()]

In [38]:
df5=df5[df5['p1'].notnull()]

In [39]:
df5

    Book   p1 p5
1  book2    2  4
3  book4  4.5  4
6  book7  2.5  4
7  book8    2  1

In [40]:
manhattandistance=distance.cityblock(df5['p1'].astype(float),df5['p5'].astype(float))

In [41]:
p1_p5=manhattandistance

In [42]:
p.append(p1_p5)

In [43]:
df1=df.drop(['p2','p3','p4','p5','p7','p8'],axis=1)

In [44]:
df6=df1[df1['p1'].notnull()]

In [45]:
df6=df1[df1['p6'].notnull()]

In [46]:
df6=df6[df6['p1'].notnull()]

In [47]:
df6

    Book   p1   p6
1  book2    2  4.5
3  book4  4.5    5
4  book5    5    5
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    4

In [48]:
manhattandistance=distance.cityblock(df6['p1'].astype(float),df6['p6'].astype(float))

In [49]:
p1_p6=manhattandistance

In [50]:
p.append(p1_p6)

In [51]:
df1=df.drop(['p2','p3','p4','p5','p6','p8'],axis=1)

In [52]:
df7=df1[df1['p1'].notnull()]

In [53]:
df7=df1[df1['p7'].notnull()]

In [54]:
df7=df7[df7['p1'].notnull()]

In [55]:
df7

    Book   p1 p7
0  book1  3.5  5
1  book2    2  2
3  book4  4.5  3
4  book5    5  5
5  book6  1.5  4
6  book7  2.5  5

In [56]:
manhattandistance=distance.cityblock(df7['p1'].astype(float),df7['p7'].astype(float))

In [57]:
p1_p7=manhattandistance

In [58]:
p.append(p1_p7)

In [59]:
df1=df.drop(['p2','p3','p4','p5','p6','p7'],axis=1)

In [60]:
df8=df1[df1['p1'].notnull()]

In [61]:
df8=df1[df1['p8'].notnull()]

In [62]:
df8=df8[df8['p1'].notnull()]

In [63]:
df8

    Book   p1   p8
0  book1  3.5    3
3  book4  4.5    5
4  book5    5    4
5  book6  1.5  2.5
6  book7  2.5    3

In [64]:
manhattandistance=distance.cityblock(df8['p1'].astype(float),df8['p8'].astype(float))

In [65]:
p1_p8=manhattandistance

In [66]:
p.append(p1_p8)

In [67]:
print(p)

array('d', [9.0, 4.5, 9.0, 5.0, 9.5, 8.0, 3.5])